package main

// Интерфейсы полезны для создания абстракций. И главное предостережение
// при знакомстве программиста с абстракциями — это помнить, что абстракции
// нужно открывать, а не создавать. Это означает, что мы не должны начинать
// создавать абстракции в коде, если для этого нет веской причины. Нужно не
// конструировать интерфейсы, а ждать возникновения конкретной потребности в них.
// Иными словами, создавайте интерфейс только тогда, когда он действительно
// нужен, а не тогда, когда возникает лишь ощущение, что он может понадобиться.
